tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/php'
tap 'homebrew/services'
brew 'caddy'
brew 'dnsmasq', restart_service: true
brew 'exiftool'
brew 'faac'
brew 'lame'
brew 'x264'
brew 'xvid'
brew 'ffmpeg', args: ['with-libvorbis', 'with-libvpx']
brew 'libpng'
brew 'freetype'
brew 'gdbm'
brew 'gettext'
brew 'jpeg'
brew 'libtiff'
brew 'little-cms2'
brew 'ghostscript'
brew 'htop'
brew 'icu4c'
brew 'ipcalc'
brew 'oniguruma'
brew 'jq'
brew 'libogg'
brew 'libvorbis'
brew 'libvpx'
brew 'libxml2'
brew 'libyaml'
brew 'openssl'
brew 'mariadb', restart_service: true
brew 'md5sha1sum'
brew 'mtr'
brew 'nmap'
brew 'pcre'
brew 'pkg-config'
brew 'pssh'
brew 'pwgen'
brew 'readline'
brew 'terraform'
brew 'texi2html'
brew 'tree'
brew 'unixodbc'
brew 'watch'
brew 'wget'
brew 'yasm'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'
brew 'homebrew/php/php56'
brew 'homebrew/php/composer'
brew 'homebrew/php/php56-yaml'
brew 'homebrew/php/php70'
brew 'homebrew/php/phpunit'
cask 'wkhtmltopdf'
