# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'wget'
brew 'htop'
brew 'hostess'
brew 'ipcalc'
brew 'jq'
brew 'md5sha1sum'
brew 'mtr'
brew 'nmap'
brew 'pssh'
brew 'pwgen'
brew 'terraform'
brew 'watch'
brew 'tree'

# Apps
cask '1password'
cask 'alfred'
cask 'atom'
cask 'caffeine'
cask 'firefox'
cask 'google-chrome'
cask 'hipchat'
cask 'iterm2'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'skype'
